[{"rank":1,"user_name":"daenz","text":"I lived in Chicago and paid $1500\/mo for a 1500 sq\/ft loft in River North, AC, dishwasher, in-unit laundry.  The rents here are insane compared to other places.","salty_score":0.3786761476},{"rank":2,"user_name":"clouddrover","text":"San Francisco to Los Angeles is an easy drive in a Chevy Bolt, for example.","salty_score":0.3795965348},{"rank":3,"user_name":"thanksforfish","text":"Each service provider needs to balance security and convenience based on the market they serve. Forced MFA for a product designed to be an easy to use video conferencing tool feels incorrect.","salty_score":0.3909533409},{"rank":4,"user_name":"adventured","text":"They'll drag their feet until they can't. It's a go first bunch-up. Eventually someone will do it as a competitive advantage attempt and the rest will fast-follow (you see this happen frequently in such markets, as with the $0 stock trading bunch-up & fast-follow that happened recently). The various US credit card & processing companies have an extraordinary thing going for themselves. Visa and Mastercard have cartel-like margins (Visa's operating income margin for 4Q19 was 66%, you don't see that outside of maybe illicit drug operations or Facebook's monopoly in its earlier thinner incarnation pre-Russiagate). They're super sensitive to giving any ground on their fee levels, out of fear (correctly so) that they'll never get them back. Before the market drop, Visa was worth more than all publicly traded banks in Europe combined (frankly that may still be true post market drop, as Visa hasn't declined all that much).","salty_score":0.3933815868},{"rank":5,"user_name":"1123581321","text":"We did our PPP loan for our agency through a small regional bank that bent over backwards to help local businesses understand the legislation and apply on time. The bank paid a bunch of salaries to be able to do this. It’s completely reasonable that they earned a small, disclosed-in-advance fee from our loan to pay for those operations.","salty_score":0.408622781},{"rank":6,"user_name":"defectbydesign","text":"Death of unfair competition from communist organizations living on private money from anticompetitive tech giants. Open source have to die to give back value to the software industry.","salty_score":0.4093373129},{"rank":7,"user_name":"toomuchtodo","text":"Thanks for pointing out that traditional state unemployment benefits alone are also insufficient for adequately cushioning citizens from job loss, and that federal intervention was required. Otherwise, your state unemployment benefits are going to be right around or somewhat above US poverty level guidelines for an individual. If you want people to stay home to not exacerbate a pandemic, you pay them to stay home.","salty_score":0.4112433817},{"rank":8,"user_name":"adrr","text":"Because smaller banks don't have the compliance team or technology to allow other companies to manage accounts.  There's only a few banks that do this.  All the challenger banks mainly use the same banks.   The core bank systems don't support multi-tenant, most were designed in 90s or 80s and sometimes 70s.  The bank needs to build a middle tier to control access so accounts are separated between companies.  Protocols to these systems are terrible, its pretty much a terminal and you are reading columns and line positions to get data.      SVB i think actually runs a pretty modern core bank system that has \"modern\" API, probably soap.","salty_score":0.4121350377},{"rank":9,"user_name":"verdverm","text":"Marcel is currently rewriting the core evaluator. Some of the first changes to hit master are the syntax changes. We are quickly moving towards a stable Cue! v0.1.2 brings OpenAPI and improved JSONSchema support throughout Cue and it's tooling. Some highlights for master are: - New style definitions using the \"#\" syntax. This is great because it makes them stand out and does wonders for ease of comprehension\n- New style \"let\" aliases and \"front style\" list comprehensions, where the for part comes first. Overall, these are the user facing changes. Marcel has some ambitious goals for the evaluator and performance. Looking forward checking out more commits as they land over the coming weeks. https:\/\/github.com\/cuelang\/cue\/commits\/master https:\/\/github.com\/cuelang\/cue\/releases https:\/\/cuelang.org","salty_score":0.4161020648},{"rank":10,"user_name":"tsbinz","text":"The goal is still to get back to containment, from yesterday's press conference: \"Koch: Das ist genau unser Ziel. Nämlich eine Situation mit einem so geringen Infektionsrisiko, dass man alle Kontaktketten zurückverfolgen kann. Dann wäre es auch möglich, ein etwas normaleres Leben zu führen. Es ist extrem schwierig eine zeitliche Voraussage zu treffen. Der Trend ist im Moment positiv und wenn wir unter 100 Fällen am Tag sind, ist das Contact-Tracing wieder möglich. Das kann in ein paar Wochen aber auch in ein paar Monaten sein.\" Re-opening some things is not a contradiction, as long as you keep the reproduction number <1 you are on a path so that you can contain things. Stricter measures mean you hit them earlier, laxer measures means later but you might not damage the economy as much ... but in any case they said if it flares up again the strict measures come back.","salty_score":0.4187825258},{"rank":11,"user_name":"app4soft","text":"Hope, PCem would happy to know that Soji Yamakawa[0] working on new open-source emulator of legendary Fujitsu FM TOWNS (model II MX) computer.[1] [0] http:\/\/ysflight.in.coocan.jp\/game\/towns\/townse.html [1] https:\/\/github.com\/captainys\/TOWNSEMU","salty_score":0.4204320171},{"rank":12,"user_name":"zerzar","text":"Thanks Nick!","salty_score":0.4216606643},{"rank":13,"user_name":"JAlexoid","text":"Casual journeys are still an expensive thing to do.\nDo you think a median family in US can afford a short trip to Miami, planned even a month in advance?","salty_score":0.4253313213},{"rank":14,"user_name":"jseliger","text":"By contrast consider Conor Dougherty's Golden Gates: Fighting for Housing in America https:\/\/www.amazon.com\/Golden-Gates-Fighting-Housing-America..., which is about how California in particular works hard to raise the cost of housing. Places like Seattle are a little better, with an emphasis on \"little.\" https:\/\/jakeseliger.com\/2015\/09\/24\/do-millennials-have-a-fut...","salty_score":0.4285583415},{"rank":15,"user_name":"colechristensen","text":"If you're curious go search. Sigma sells cocaine, heroin, and LSD, for example, nevermind precursors. They won't sell them to you, but they will sell them to organizations with the correct permissions to buy them.  Regulatory compliance might add to the cost, but for a company like Sigma I'd expect doing things in-house to lower costs not raise them.","salty_score":0.43023032},{"rank":16,"user_name":"BubRoss","text":"The article directly contradicts its title.  They aren't \"heat mapping employees\" they came up with a scoring system to estimate the most likely stores to unionize. \"The scores are based on more than two dozen metrics, including racial diversity, employee loyalty, \"tipline\" calls, and violations recorded by the Occupational Safety and Health Administration.\" Whatever they are doing to avoid employees unionizing, it isn't \"heat mapping\" them.  It isn't even heat mapping stores.  That would imply some sort of density+value combination.  This is a ranking based on weighting various data points into a single score.","salty_score":0.4316914806},{"rank":17,"user_name":"treyfitty","text":"No. As a purchaser of enterprise software, they (Even big SaaS vendors) do this so: 1) Onboarding at large companies can get unique and they start the convo right from the beginning. Having a real person pays dividends later, especially for up selling services. 2) Sales teams need to eat. Attribution becomes easier this way. Companies with dedicated sales teams aren’t small.","salty_score":0.4334492615},{"rank":18,"user_name":"jsanford9292","text":"Looks like (b) is the answer. They released this tweet on Aug 7, 2019 (the next day after announcing they were targeting an LSE-listed company): https:\/\/twitter.com\/muddywatersre\/status\/1159009866020618241 Pretty amazing that they went through and took a look at all the companies whose stock prices dropped from Aug 6-7th on LSE as a sort of \"business development\" opportunity.","salty_score":0.4360024715},{"rank":19,"user_name":"luminousbees","text":"integration of all the different parts on board in a single base: WIFI with ESP8266 WiFi, brushless motors, 4x ESC last generation BLHeli32 with telemetry and DSHOOT up to 2400 -- FlighControl -- IMU -- baro -- compass -- power system with 1 easily swappable Li-Ion 18650 for maximum flight time -- rangeFinder for accurate low height navigation 0-3m -- sdcard slot for Log -- connector for common RC radio and telemetry + connector for all the external add-ons like GPS, indoor positioning system, optical flow, 8 horizontal rangefinder for collision advoiance,...  All these hw connected with the Ardupilot features. Furthermore, for small copter its very hard to have good flight time, ArduBee try to have very good flight time, safe and ready for makers to develop, supported by one of the best Open Source project for drone, Ardupilot.\nIt has been developed to be used safely for urban swarm robotics application development, education, creativity! https:\/\/ardupilot.org\/copter\/ ESP8266 with Ardupilot (telemetry and control)\nhttps:\/\/ardupilot.org\/copter\/docs\/common-esp8266-telemetry.h... BLHeli_32 ESC Telemetryhttps:\/\/ardupilot.org\/copter\/docs\/common-dshot-blheli32-tele...","salty_score":0.4362790756},{"rank":20,"user_name":"symplee","text":"https:\/\/en.wikipedia.org\/wiki\/COVID-19_testing#Virus_testing... Shows the following stats:   Country--------Date-----Tests-------Positive----%-------Tests\/mil ppl----Positive\/mil ppl\n  -----------------------------------------------------------------------------------------\n  United States--18 Apr---3,700,388---720,747-----19.5----11,273-----------2,196\n  Russia---------19 Apr---1,949,813---42,853------2.2-----13,287-----------292\n  Germany--------15 Apr---1,728,357---132,766-----7.7-----20,786-----------1,597\n  Italy----------19 Apr---1,356,541---178,972-----13.2----22,474-----------2,965\n  Spain----------13 Apr---930,230-----169,496-----18.2----19,905-----------3,627","salty_score":0.4372389399},{"rank":21,"user_name":"peter_d_sherman","text":"Excerpt: \"Scientists have discovered a new Earth-sized planet in a star’s habitable zone—the region where liquid water could exist on its surface. The discovery was made using data from the now-retired Kepler Space Telescope. Out of all the exoplanets found by Kepler, this new world—located 300 light-years from Earth—is most similar to Earth in size and estimated temperature.\"","salty_score":0.4382718992},{"rank":22,"user_name":"missedthecue","text":"This sounds like something Vodafone would write up. Jio prices now are lower than all their competitors prices were 5 years ago. Even if Jio raised prices a little higher than they ever were, it doesn't therefore follow that the indian consumer is worse off for having the new player. And vodafone and others didn't leave the indian market. Jio isn't the only player in India. They'll always have competition that keeps them from raising prices to confiscatory rates.","salty_score":0.4392198531},{"rank":23,"user_name":"edoo","text":"New York is at 1.3 percent positive with new cases flatlining.  That fits very squarely with what you'd expect to see based on the surveys.  Healthy people aren't dying by any significant number based on New York's own published data.  The only other one I've seen is MA that has 97.5% deaths with comorbidity. This is a huge overreaction.","salty_score":0.4397928979},{"rank":24,"user_name":"nl","text":"Only 2 North American universities. 12 programs in California funded.","salty_score":0.4405167108},{"rank":25,"user_name":"DonHopkins","text":"Katherine Eban just published this extensive article about Larry Ellison's hydroxychloroquine app on Vanity Fair, based on leaked internal documents. And in this MSNBC interview, she talked about how Larry Elison convinced Trump to push hydroxychloroquine to anyone who wanted to take it, and also distribute his cloud-based Protected Health Information sucking \"information collector\" app to all those human guinea pigs: Vanity Fair looks at Trump's plan to battle virus with unproven drug. Vanity Fair contributor Katherine Eban discusses new reporting on the president's plan to beat COVID-19, which involved distributing millions of doses of an unproven drug. https:\/\/www.msnbc.com\/morning-joe\/watch\/vanity-fair-looks-at... >As health officials navigated a minefield of long-standing regulations that were impeding the White House campaign, the message from the presidential podium was exultant: Trump had zeroed in on a potential cure and had slashed red tape to speed it to patients in need. On April 4, the president declared that the tech giant Oracle had donated a “very sophisticated” web portal to gather real-time data on how patients were responding to the new treatments. [...]","salty_score":0.4405891181},{"rank":26,"user_name":"chapium","text":"River North is insanely expensive even with NYC\/SF to compare to.","salty_score":0.4405952531},{"rank":27,"user_name":"specialist","text":"What safe guards are in place to prevent Microsoft from using GitHub to glean competitive intelligence? Just like Facebook used Onavo. https:\/\/www.wsj.com\/articles\/facebooks-onavo-gives-social-me...","salty_score":0.4409010213},{"rank":28,"user_name":"DonHopkins","text":"Stay positive: \"solid shirts\" works just fine.","salty_score":0.4418615797},{"rank":29,"user_name":"zo1","text":"OP said: Amazon implements all these rules at each stage, neverminding the \"good-faith\" interpretation of the original and subsequent laws put in place each time. I.e. \"We just don't want platforms abusing their power to undercut genuine businesses.\" But at this stage we've, through genuine and honest market \"interventions\" and reasonable rules that seem straightforward and simple and cheap to implement, created regulatory costs that by default get applied to every new \"platform\" that competes in a space similar to Amazon. You've now successfully put in place regulations that inhibit and prevent competitors manifesting to compete with the existing monopoly or oligopoly.","salty_score":0.4420251605},{"rank":30,"user_name":"keiferski","text":"The culture simply isn’t there anymore in any focused form. Reddit, HN or wherever probably isn’t comparable to having an entire empire’s brightest minds in the same cafe on a daily basis.","salty_score":0.4423370645},{"rank":31,"user_name":"gambiting","text":"Polish universities are completely free. And yes, British universities are not free, they have recently gotten pretty expensive(£9000\/year), with the exception of Scottish ones which have different rules.","salty_score":0.4444756972},{"rank":32,"user_name":"dntbnmpls","text":"According to your definition if there are recognizable major natural landmarks ( \"Mount Ararat\", \"river Hrazdan\" ), then it means nothing has changed since people in the past would recognize it and be able to place themselves. So using your logic, any city near a major mountain, river, etc would be recognizable. So tokyo ( visible from Mt Fuji ) hasn't changed, manhattan hasn't changed ( hudson\/east rivers ), seattle hasn't changed ( Mt Rainier ), etc.","salty_score":0.4446095076},{"rank":33,"user_name":"greglindahl","text":"I'm guessing you don't live in urban California, where most grocery stores installed L2 chargers 5 years ago? They were intended for short-range EV charging, and most EVs aren't short range enough to find them useful. I rarely see anyone charging at the ones in Palo Alto. Some Tesla Superchargers are near grocery stores, that's a pretty nice combination. I do have one friend who hasn't bothered to install a home charger because she can use the supercharger next to her favorite grocery store.","salty_score":0.4450447273},{"rank":34,"user_name":"lowdose","text":"Let's for simplicity apply Occam's razor: When we didn't have modern birth control solutions cultural rituals were an effective measure against women giving birth to seven children from different men. We removed that natural health taxing consequence of having sex. Could you elaborate on your fence a bit because I'm always curious about unknown unknowns to me.","salty_score":0.4451004286},{"rank":35,"user_name":"jodrellblank","text":"It's paywalled, but AIM is the London Stock Exchange's less regulated sibling, the Alternative Investements Market, and the main claim from the article is: > \"close to 3,000 companies have listed on Aim, but 72 per cent of them have never produced a return for investors, according to professors Elroy Dimson and Paul Marsh of the London Business School. Worse still, nearly one in three Aim companies have resulted in shareholders losing 95 per cent or more of their initial investment.\"","salty_score":0.4459564031},{"rank":36,"user_name":"londons_explore","text":"In 10 years, visible light frequencies will be regulated just like radio is today. \"Sorry, you can't flash a 630 nanometer orange light - only Comcast has a license to do that here\". \"You can use the 611 nanometer yellow-orange band, but only if your light is dimmer than 5 watts and switches off within 1 microsecond when requested to do so by emergency services\".","salty_score":0.4462800488},{"rank":37,"user_name":"yesenadam","text":"I started installing haskell a lil while ago with macports but I got as far as bash$ port rdeps ghc The following ports are dependencies of ghc @8.8.3_0: gnupg2 pkgconfig libiconv gperf gettext ncurses zlib\n xz bzip2 libassuan libgpg-error pth libksba libgcrypt\n readline gnutls autoconf automake libtool xattr\n unzip gtk-doc glib2 libxml2 icu libffi pcre libedit\n libxslt perl5.28 db48 gdbm docbook-xml xmlcatmgr\n docbook-xml-4.1.2 docbook-xml-4.2 docbook-xml-4.3\n docbook-xml-4.4 docbook-xml-4.5 docbook-xml-5.0 docbook-xsl-nons\n itstool gawk py27-libxml2 python27 expat openssl\n sqlite3 python_select python2_select\n python38 python3_select py38-anytree\n py38-setuptools py38-six py38-pytest py38-setuptools_scm\n py38-py py38-packaging py38-attrs py38-hypothesis\n py38-sortedcontainers py38-zopeinterface\n py38-parsing py38-more-itertools\n py38-pluggy py38-wcwidth pytest_select py38-nose\n nosetests_select py38-lxml py38-pygments pygments_select\n py38-mock clang-9.0 cmake libcxx curl libidn2\n libunistring perl5 texinfo help2man p5.28-locale-gettext\n libpsl curl-ca-bundle libarchive lzo2 lz4\n zstd libuv libomp llvm-9.0 xar llvm_select clang_select ld64\n ld64-latest libmacho-headers libtapi gmp libtasn1\n p11-kit nettle libusb-compat libusb npth pinentry-mac openldap\n tcp_wrappers cyrus-sasl2 kerberos5 libcomerr coreutils\n alex stack\n happy HsColour python37 py37-sphinx py37-docutils py37-roman py37-setuptools\n py37-alabaster py37-babel py37-tz py37-pytest py37-setuptools_scm py37-py\n py37-packaging py37-attrs py37-hypothesis py37-sortedcontainers py37-six\n py37-zopeinterface py37-parsing py37-more-itertools py37-pluggy\n py37-importlib-metadata py37-zipp py37-toml py37-wcwidth\n py37-freezegun py37-dateutil py37-pytest-cov py37-coverage\n py37-mock py37-imagesize py37-jinja2 py37-markupsafe py37-pygments py37-requests\n py37-chardet py37-idna py37-urllib3 py37-certifi py37-snowballstemmer\n sphinx_select py37-sphinxcontrib-applehelp\n py37-sphinxcontrib-devhelp py37-sphinxcontrib-htmlhelp\n py37-sphinxcontrib-jsmath py37-sphinxcontrib-serializinghtml\n py37-sphinxcontrib-qthelp texlive texlive-basic texlive-common\n texlive-bin fontconfig freetype libpng ossp-uuid libzzip\n cairo libpixman xrender xorg-libX11 xorg-xtrans\n xorg-xorgproto xorg-util-macros xorg-libXdmcp xorg-libXau\n xorg-libxcb xorg-xcb-proto xorg-libpthread-stubs\n xorg-libXext xorg-xcb-util\n graphite2 fonttools py37-unicodedata2 py37-brotli\n harfbuzz harfbuzz-icu libpaper mpfr potrace\n xorg-libXp xpm xorg-libXt xorg-libsm xorg-libice\n xorg-libXaw groff ghostscript jbig2dec\n jpeg libidn tiff lcms2 psutils netpbm\n jasper jbigkit libnetpbm xorg-libXmu\n xorg-libXi xorg-libXfixes texlive-bin-extra latexmk\n texlive-latex detex latexdiff p5.28-algorithm-diff\n pdfjam texlive-latex-recommended\n pgf dvipng gd2 webp giflib t1lib dvisvgm\n asciidoc fop brotli woff2 texlive-context texlive-metapost texlive-xetex\n texlive-plain-generic texlive-fonts-recommended\n texlive-math-science texlive-fontutils lcdf-typetools ps2eps t1utils\n texlive-lang-czechslovak texlive-lang-english\n texlive-lang-european texlive-lang-french\n texlive-lang-german texlive-lang-italian\n texlive-lang-polish texlive-lang-portuguese\n texlive-lang-spanish texlive-luatex\n texlive-fonts-extra texlive-latex-extra\n texlive-pictures And decided to give it a miss.","salty_score":0.446993501},{"rank":38,"user_name":"ip26","text":"Small kids are a full time job 24 hours a day with no time off. Under lockdown, you can't even go out on date night or play dates (aka teamwork with other parents). They are also by nature incapable of being quiet for 8 hours.","salty_score":0.447454506},{"rank":39,"user_name":"ignoramous","text":"I want to point out that 5 vaccines (out of 78) are in phase 1 trials (4 of those actively looking for volunteers, visit clinicaltrials.gov links below to see if you qualify): 1. mRNA-1273 (lipid nanoparticle encapsulated mRNA vaccine encoding S protein) by Moderna: https:\/\/clinicaltrials.gov\/ct2\/show\/NCT04283461 2. Ad5-nCoV (Adenovirus type 5 vector that expresses S protein) by CanSino Biologicals: NCT04313127. 3. INO-4800 (DNA plasmid encoding S protein delivered by electroporation) by Inovio Pharmaceuticals: https:\/\/clinicaltrials.gov\/ct2\/show\/record\/NCT04336410 4. LV-SMENP-DC (Dendritic cell modified with lentiviral vector expressing synthetic minigene based on domains of selected viral proteins; administered with antigen-specific cytotoxic T lymphocyte) by Shenzhen Geno-Immune Medical Institute: https:\/\/clinicaltrials.gov\/ct2\/show\/NCT04276896 5. Pathogen-specific artificial antigen-presenting cell (aAPCs modified with lentiviral vector expressing synthetic minigene based on domains of selected viral proteins) by Shenzhen Geno-Immune Medical Institute: https:\/\/clinicaltrials.gov\/ct2\/show\/NCT04299724 Ref: https:\/\/www.nature.com\/articles\/d41573-020-00073-5","salty_score":0.4479656875},{"rank":40,"user_name":"kalleboo","text":"Applies to 13 inch only, 15 inch has always had full bandwidth on all ports","salty_score":0.4481637027},{"rank":41,"user_name":"kelnos","text":"It still takes extra staff to make this happen.  Normal grocery staff isn't just wandering around the store aimlessly; they're restocking and doing other administrative tasks.  Most of those tasks don't just go away when you move to a curbside pickup model.  You still need to hire and train more people to fulfill orders.","salty_score":0.4488231768},{"rank":42,"user_name":"lowdose","text":"And a link to his innovation.","salty_score":0.449057598},{"rank":43,"user_name":"peter_d_sherman","text":"Excerpt: \"Supports... DICT, FILE, FTP, FTPS, Gopher, HTTP, HTTPS, IMAP, IMAPS, LDAP, LDAPS, POP3, POP3S, RTMP, RTSP, SCP, SFTP, SMB, SMBS, SMTP, SMTPS, Telnet and TFTP. curl supports SSL certificates, HTTP POST, HTTP PUT, FTP uploading, HTTP form based upload, proxies, HTTP\/2, cookies, user+password authentication (Basic, Plain, Digest, CRAM-MD5, NTLM, Negotiate and Kerberos), file transfer resume, proxy tunneling and more. What's curl used for? curl is used in command lines or scripts to transfer data. It is also used in cars, television sets, routers, printers, audio equipment, mobile phones, tablets, settop boxes, media players and is the internet transfer backbone for thousands of software applications affecting billions of humans daily.\" Source Code: https:\/\/github.com\/curl\/curl","salty_score":0.4492953887},{"rank":44,"user_name":"pwg","text":"Likely something like how this at home mail in test handles those exact same risks: https:\/\/www.cologuardtest.com\/ The sample is sealed inside a heavy grade plastic container with a screw top lid. The plastic container is sealed inside a heavy weight zip-lock bag already form fitted to the inside of the shipping box. The shipping box itself is quite sturdy. I suspect something similar for this new LabCorp test, just customized for a swab.","salty_score":0.4503793434},{"rank":45,"user_name":"kerkeslager","text":"True, but that has very little to do with stock price. In fact, making a profit doesn't cause companies to distribute dividends. When stock prices aren't based on dividend potential, stock price slowly becomes detached from reality. Price becomes pure speculation. Worse, you can do insane things like borrowing money to buy back your own stock: this drives up the price while harming the company's future prospects because they now have to pay that loan back with interest.","salty_score":0.4505630399},{"rank":46,"user_name":"slg","text":"You are right. I was eyeballing the daily stock chart.  That $969 peak was a few weeks before the general market selloffs began.  However Tesla was right around $900 when the market started to dip in late Feb so my general point still stands.","salty_score":0.4513700588},{"rank":47,"user_name":"rechristened","text":"Their governing board includes Brewster Kahle (Internet Archive), Mark Surman (Mozilla Foundation), Stephan Wolfram (Wolfram Alpha), and Paul Vixie (Internet Systems Consortium).","salty_score":0.4517407645},{"rank":48,"user_name":"netjiro","text":"Check out Iceland. https:\/\/usgreenchamber.com\/how-iceland-is-revolutionizing-gr... Slowly developing insulated indoor aquacultures, led lighting, robotic harvesting, perfect climate control, gas mixture, mineral and nutrients. With near future robotics we'll see near zero carbon footprint production with near zero human work load for a fairly wide range of healthy foods.","salty_score":0.4518201908},{"rank":49,"user_name":"Taniwha","text":"Here in NZ the govt hasn't sent people $1200, nor have they given large amounts of money to businesses to stay alive while we're all locked up. What they have done is:\n- allowed companies who's income has dropped by 30% to claim $600\/employee\/week of salary support\n- negotiated with all the banks to allow mortgage holidays Think of it as trickle up stimulus and trickle down rent subsidies to keep people connected to companies and as many companies as possible still viable We're getting close to having Covid beat(only 5 new cases today, all from known sources), next week we slowly start dropping out of lockdown","salty_score":0.4527479551},{"rank":50,"user_name":"thu2111","text":"Where are you getting your information? Re: Ventilators in New York. New York doesn't have a ventilator shortage and never did. It had a predicted shortage based on bad simulations, but never a real one. In fact it's now sending ventilators elsewhere: https:\/\/www.nationalreview.com\/2020\/04\/coronavirus-crisis-ve... \"On April 2, Cuomo predicted the state would run out of ventilators in six days “at the current burn rate.” But on April 6, Cuomo noted, “We’re ok, and we have some in reserve.” Now New York appears to have passed the apex. Deaths, a lagging indicator, crested at 799 on April 9 and hit 606 on April 16, the lowest figure since April 6. Hospitalizations are also declining, and on April 16 also hit their lowest level since April 6. Cuomo today has so many ventilators he is giving them away: On April 15, he said he was sending 100 of them to Michigan and 50 to Maryland. On April 16, he announced he was sending 100 to New Jersey.\" I'm morbidly fascinated by what you're reading that has led you to this belief. Re: ICU beds: I was talking about the world generally rather than New York specifically. For example in New Jersey on April 8th only 3 hospitals were load balancing to others: https:\/\/twitter.com\/alexberenson\/status\/1247920918640410624?... In New York city (vs state) the field hospitals that were built have hardly been being used. https:\/\/eu.usatoday.com\/story\/news\/health\/2020\/04\/16\/coronav... \"the field hospital constructed inside the massive Jacob K. Javits Convention Center in Hudson Yards, had 340 patients as of Tuesday afternoon ... The facility has a maximum capacity of 2,500 hospital beds. As of Tuesday afternoon, the Javits Center hospital had treated about 700 patients\" Even on April 1st, the New York Post visited an ICU and found it was only handling double the normal case load, well within capacity (13 patients normally, 26 then): https:\/\/nypost.com\/2020\/04\/01\/a-look-inside-an-nyc-hospital-... Certainly there are cases where single hospitals ran out of space and started load balancing onto nearby hospitals. But, that happens during normal times too. Where are you reading this? [empty hospitals] The essay isn't only about New York, it's trying to generalise not only to America but the whole western world. And across the world hospitals are laying off staff due to underload: https:\/\/news.google.com\/search?q=hospital%20furlough&hl=en-U... Who would CPAP machines be for? Why bring them up? CPAP - the pressure type, not the sleep machines - is now a common therapy for treating COVID-19. For example the British Prime Minister wasn't put on a ventilator but rather given only CPAP (basically, a mask connected to the hospital oxygen supply). This is because there's a growing belief in the medical world that ventilators can cause more harm than good for COVID patients. https:\/\/www.medscape.com\/viewarticle\/928156 None of which are actually effective in the face of historic unemployment. That's not a rebuttal. Systems to distribute money exist. The idea they've never been built, as the essay argues, isn't right. If you want to argue they aren't designed for sustaining a world under house arrest, by all means do so, but no country on earth has created schemes specifically for that. Making masks which reduce individual aerosol dispersal is easy. N95 masks are harder Andreessen was talking about medical-grade masks designed to protect doctors from patients, not ad-hoc home made things. And for those masks the point stands: it's hard to make them but he says it's easy. As for medical literature, go read the links to papers and studies here: https:\/\/swprs.org\/a-swiss-doctor-on-covid-19\/ There are many links to papers, comments and articles by doctors and other specialists who are arguing that the virus is clearly not as deadly as feared. For example, the serology survey that's in the first link under the April 18th update was discussed here on HN just recently. That's good news, by the way! Don't you hope they're right? My experience is that some people posting on HN don't actually want to study what people bringing good news are saying.","salty_score":0.4527710743},{"rank":51,"user_name":"jldugger","text":"Honestly, I find Marketplace's obsession with politics annoying. IDK if they just have an easier time sourcing interviews from government officials because public radio or something, but it feels like even in times of non-distress they lean heavy on policy and lean on actual markets. Look at the non-COVID Make Me Smart topics as an example: - Housing policy\n- Corporate social responsibility\n- food policy to fight global poverty\n- the equal rights act\n- facebook and US elections\n- regulating the internet with section 230\n- an interview with a senior politico editor about the school-skills-jobs pipeline\n- why private equity needs to be regulated That said, I do appreciate the Marketplace interviews with 'regular small business owners' Marketplace has been doing lately. Ranchers, Mississippi freighters, factory operators, etc. In terms of other podcasts, Bloomberg's Odd Lots podcast[1] is a nice long form podcast with subject matter experts. Their guests also likely have a political agenda, but you at least get exposed to the inner workings of a market. A recent pair of podcasts provides a good example: a few months ago they talked with a guest about an unusual feature of Korean retail banking, the structured note. They provide investors--primarily retirees--a fixed 7.8 percent return if the market doesn't drop by a huge margin. Otherwise, investors are stuck with the return of the underlying benchmark (which is down a huge margin). Well, last month exactly that exact tail risk scenario triggered, and they brought the guest back on to further discuss how this compares with previous bank crisis episodes. [1]: https:\/\/www.bloomberg.com\/podcasts\/odd_lots","salty_score":0.4534268648},{"rank":52,"user_name":"JoshTriplett","text":"It's worth learning both how FAT32 works and how a simple inode-based filesystem works. They're quite different styles, and inode-based systems support things like hardlinks.","salty_score":0.4535774516},{"rank":53,"user_name":"kube-system","text":"Depends on the app and how outdated we're talking about.  You can buy new Android devices on the shelf from major retailers that won't run some mainstream apps.","salty_score":0.4537403322},{"rank":54,"user_name":"shaklee3","text":"In our case clickhouse was significantly faster at insertions and querying compared to druid. Which metrics did you test?","salty_score":0.4539257113},{"rank":55,"user_name":"sbmthakur","text":"I highly recommend Secret history of Silicon Valley series by Steve Blank: https:\/\/steveblank.com\/2009\/03\/23\/if-i-told-you-i%e2%80%99d-... Steve has written in detail about how early signal intelligence came to be, how eventually they shaped the Silicon valley and modern tech. Other posts on Steve's blog are interesting too.","salty_score":0.4546505463},{"rank":56,"user_name":"lpil","text":"Thank you Raj, you're pretty great yourself!","salty_score":0.455019134},{"rank":57,"user_name":"bartread","text":"Quite so. \"Shirt without stripes\" can include shirts in plenty of patterns other than solid colours (paisley, polka dot, checked, battenberg, floral print, etc.).","salty_score":0.4557217907},{"rank":58,"user_name":"sp332","text":"Larger strawberry varieties do tend to be bland in my experience. Also carrots are root storage while strawberries are more temporary, so maybe they get prioritzed differently in plants that adapt to really long dark stretches.","salty_score":0.4562366536},{"rank":59,"user_name":"op03","text":"Interesting. Thanks for the links!","salty_score":0.4563318811},{"rank":60,"user_name":"rasz","text":"chipsets arent even electrically connected to memory in modern computers, so umm?","salty_score":0.4563462109},{"rank":61,"user_name":"jedberg","text":"That was new to me, thanks!","salty_score":0.456863625},{"rank":62,"user_name":"dredmorbius","text":"Sorry, what's your source?  Your link fails to address your assertion at all. Any website key retention is out of convention rather to ensure data access, and a convention Let's Encrypt is fast upending: The certificate is valid for 90 days, during which renewal can take place at any time. https:\/\/en.wikipedia.org\/wiki\/Let%27s_Encrypt Key exchange is a component of PKI.  You either need to know, or be able to request, a given key to validate it, or transmissions based on it. TLS (as SSL before it) relies on certificate authorities (CAs), whose keys 1) are distributed to all major browsers and\/or operating systems, and 2) which then vouch for website keys.  Other mechanisms (e.g., key pinning) are also used.  This model has many critics. PGP (or Gnupg, and alternate implementation) rely, also to various degrees of general criticism, on a web of trust model, in which keys are signed by various other keys, possibly but not necessarily the user's own.  Trust is ideally personally verified.  It's been observed that this poses scaling issues. Other PKI models have their own approaches to key trust. S\/MIME uses CAs similarly to TLS\/SSL, for key authentication, but keys themselves must still be retained, and secured, to assure future data access and integrity.  SSH effectively relies on TOFU (trust on first use) or OOB (out of band) key distribution -- both of which effectively punt the process. TLS, SSL, and SSH are all session-based (data-in-flight) protocols.  PGP and S\/MIME are storage-oriented, data-at-rest protocols. My initial comments apply to each.","salty_score":0.4571727728},{"rank":63,"user_name":"maxerickson","text":"They are heavily based on divisions and recent seasons. (For example, in the NFL, the teams in each division play each other twice, and then get the rest of their games by rotating through teams from the rest of the league)","salty_score":0.4575146219},{"rank":64,"user_name":"ssivark","text":"Where did the foundational ingredients for each of those things come from? Computers, networks, video compression, touchscreens, materials, ... heck, even pagerank, and a large fraction of the breakthroughs in ML\/AI (till very recently) have come from academia -- through publicly funded research. Companies are very good at solving the \"last mile\" to apply technologies towards making products, but don't typically have the vision or the wherewithal to pursue deeper innovations.","salty_score":0.4575281314},{"rank":65,"user_name":"fluffything","text":"Thanks for the link to the HN discussion. The Regent language (Legion is Regent's runtime) is yet another async task-graph-based PGAS language\/run-time, similar to, e.g., HPX, but leaving out what in my opinion made Sequoia interesting (e.g. the memory hierarchy abstraction capabilities).","salty_score":0.4580020238},{"rank":66,"user_name":"jandrese","text":"That phrasing was somewhat tongue in cheek, but you've hit the main problem.  Natural languages are constantly mixing, evolving, mutating, and diversifying.  As a result they pick up loads of sometimes temporary inconsistencies and regional variances that simply require the person learning it to memorize an ever changing set of arbitrary rules. Computer languages on the other hand are far more static, so once you've learned its typically very simple grammar and vocabulary you are done save for a handful of tweaks in major version updates that happen only once every few years.","salty_score":0.4580776952},{"rank":67,"user_name":"luckylion","text":"Similarly how Microsoft launching Internet Explorer to beat Netscape and eat another Market was technically more competition (for a while, until they've established another monopoly and all competition ceases).","salty_score":0.4582409425},{"rank":68,"user_name":"jki275","text":"I don't think they'll ever do that.  They would lose a significant majority of those of us who use Mac laptops to develop real software. They'll make cross-platform development between iOS and macOS easier, they're already doing that -- but getting rid of macOS (which is essentially what you're saying) isn't smart for them.","salty_score":0.4583492712},{"rank":69,"user_name":"exclusiv","text":"I don't think this is fully accurate. They wanted CERTAIN companies to get these loans for sure. They got to make easy commissions and give free money to companies that owe them money. But yes, they got a ton of free leads AND incredibly valuable business information which they can use to sell services later.","salty_score":0.458445634},{"rank":70,"user_name":"exabrial","text":"As an alternative: Each bank must speak a common language for transactions as part of their charter, aka \"ACH\". The task to accomplish what you wish simply becomes \"Improve ACH to realtime, rather than batch\" and a bunch of our problems go away. Furthermore, give banks more freedom as to how they want to interchange money so competition is created to force fees and middlemen down. The nice thing about this approach is there's a fast default path via ACH, but banks are free to innovate elsewhere, improving services.","salty_score":0.4584702828},{"rank":71,"user_name":"TeMPOraL","text":"I'm talking about the \"it's better to force forgiveness than ask for permission\" part, and they weren't in grey area - in a lot of places, they were doing plainly illegal business. I'm talking about their business model of \"let's do illegal business and use deep pockets to keep regulators at bay, until we get enough public support to make ourselves invulnerable\". Also known as totally unfair competition. I'm also talking about insurance and worker rights shenanigans, and a host of other sociopathic behaviors their management exhibited (all reported on in detail over the past years). On top of that, cabs were awful in some cities in some places around the world. They worked well enough in others. Over here (Kraków area, Poland), we had private point-to-point transport companies that managed to change the law through a proper court process, like civilized people do.","salty_score":0.4589302896},{"rank":72,"user_name":"pnw_hazor","text":"\"However, we concluded that Mr. Ubhi’s brief early involvement in the JEDI Cloud Initiative was not substantial and did not provide any advantage to his prospective employer, Amazon, in the later JEDI Cloud contract competition, which was decided two years after Mr. Ubhi’s resignation from the DoD.  Although Mr. Ubhi’s actions from September through October 2017 was misconduct, his minimal contributions to the JEDI procurement process did not affect the conduct or outcome of the JEDI Cloud source selection.\" \nJEDI ROI, Page 8, Paragraph 3 IG Report PDF\nhttps:\/\/media.defense.gov\/2020\/Apr\/15\/2002281438\/-1\/-1\/1\/REP...","salty_score":0.4589420981},{"rank":73,"user_name":"tracker1","text":"For that matter, look at say a 4th or 5th grade English textbook from the U.S. pre-1970 compared to even High School book today.","salty_score":0.4593569722},{"rank":74,"user_name":"BenoitEssiambre","text":"Always read David Beckworth: https:\/\/www.davidbeckworth.com\/popular ,https:\/\/twitter.com\/DavidBeckworth Nick Rowe: https:\/\/worthwhile.typepad.com\/worthwhile_canadian_initi\/nic... , https:\/\/twitter.com\/MacRoweNick Scott Sumner: https:\/\/www.econlib.org\/author\/ssumner\/ https:\/\/twitter.com\/MoneyIllusion Maybe, Antonios Fatas: https:\/\/twitter.com\/AntonioFatas And Also Maybe Sam Bell:  https:\/\/twitter.com\/sam_a_bell","salty_score":0.4601878296},{"rank":75,"user_name":"DanBC","text":"Inside the Ethics Committee BBC Radio 4. Not many episodes, and getting quite old now, but still an interesting look at medical ethics and UK law. https:\/\/www.bbc.co.uk\/programmes\/b007xbtd There's a bunch of audio comedy that I love, but it comes and goes -- BBC Radio 4 don't keep it up on their website.  (Party, Tim Key's Late Night Poetry Programme, John Finnemore's Souvenir Programme, Cabin Pressure, Bleak Expectations, Don't Start -- most of these are available to buy or from other sources). They've also put this page up and some of these look interesting: https:\/\/www.bbc.co.uk\/programmes\/articles\/5Jrn1bynjTc6tPj3SV...","salty_score":0.4602538463},{"rank":76,"user_name":"knzhou","text":"These programs exist, but are generally separated from the ordinary high school system. For example, right here in the Bay area there's Proof School, a private school founded precisely \"for kids who love math\", AoPS Academy, for extracurricular challenging math classes, and powerhouse public schools like Lynbrook, where gigantic student-run clubs aimed at competitions provide exactly this kind of education.","salty_score":0.4605274277},{"rank":77,"user_name":"Symbiote","text":"Even further, presumably things like kg·m·s⁻², which (perhaps) this library can equate to Newtons.","salty_score":0.4612684335},{"rank":78,"user_name":"vntok","text":"But Amazon launching new products is strictly more competition, so...","salty_score":0.461682435},{"rank":79,"user_name":"wolco","text":"These companies were always doing those things.  Google always collected and connected information on you.  Facebook was always using users content\/data to experiment with.  Cloud computing was always a mistake for most (pay more, get less control, get locked in).  Deep learning opens up so many taboos our society is not ready to deal with them.  As it scales it will open up more cans of worms.","salty_score":0.4623692495},{"rank":80,"user_name":"paganel","text":"Thanks for the 4th link, I couldn't really understand the really sad images and videos coming out of Guayaquil (Ecuador) when comparing them to the rest of South America. Apart from Buenos Aires there are also big metropolises like Sao Paulo or Rio de Janeiro where you couldn't see the same things that were happening in Guayaquil. That vaccination map for South America partly explained the difference for me, at least by correlation.","salty_score":0.4626680886},{"rank":81,"user_name":"nitrogen","text":"Is there a way to distinguish one organization registering 100000 domains (possibly using sub-entities) to get 100000 votes versus 100000 real separately controlled organizations? Would controlling a large number of votes that way give them some kind of advantage?","salty_score":0.4630795498},{"rank":82,"user_name":"nogabebop23","text":"We'll also see if in the face of double-digit unemployment (don't think that's going to resolve itself the minute we get back to work) companies that don't have these discretionary benefits loose out on talent...","salty_score":0.4633433491},{"rank":83,"user_name":"WorldMaker","text":"I think a lot of that is going to depend on the types of investors left in the stock market and the types of Highly Paid Consultants that Sell Their Vision after all of this. At the moment it seems equally likely that some companies come out of all of this with the \"lesson\" that remote work caused their downturn in productivity and stock value (who can remember that every other company experienced the same when your investors only care \"what have you done lately?\" and \"what have you done 'proactively'?\") and we'll quickly see a return to \"everybody needs to be in the office together\" culture back backed by the same consultants that learned the wrong lessons after Marissa Mayer's Yahoo! house cleaning and were still badly ratcheting companies towards as miserable as possible colocation strategies. It seems about 50\/50 to me right now which group will prevail. At least with US public traded companies the only inertia seems to whatever shiny fad stock traders are enamored with versus whatever misery HPCs manage to sell on golf courses in C-Suite handshakes. (ETA: Some of whom, the worst stock investors and HPCs are the same people, of course.)","salty_score":0.4635077746},{"rank":84,"user_name":"mlyle","text":"Certainly it is happening.  My local stores have small amounts of yeast in little beverage cups with improvised seals, made by yeast manufacturers that usually sell large quantities to restaurants and industrial bread producers. They've also briefly had shitty 1ply commercial toilet paper with big plastic bag and twist-tie packaging.","salty_score":0.4638226938},{"rank":85,"user_name":"fallingfrog","text":"Don’t forget that the primary reason to divide people up into groups based on superficial characteristics is to prevent them from forming groups based on their real shared economic interests.","salty_score":0.4641009595},{"rank":86,"user_name":"akvadrako","text":"LVT is great. You could go even further and nationalize all natural resources (oil) and sell\/rent them at market rates.","salty_score":0.4651477568},{"rank":87,"user_name":"kevin_thibedeau","text":"Most \"SUVs\" are just station wagons with an extra inch of ground clearance. They aren't that heavy. A Prius, on the other hand is close to the weight of a light truck.","salty_score":0.4653552511},{"rank":88,"user_name":"aschatten","text":"Modern day browsers are essentially VM with rich customizable GUI.","salty_score":0.4655630499},{"rank":89,"user_name":"giardini","text":"full title \"No evidence of clinical efficacy of hydroxychloroquine in patients hospitalised for COVID-19 infection and requiring oxygen:...\" from the article: \"We used data collected from routine care of all adults in 4 French hospitals with documented SARS-CoV-2 pneumonia and requiring oxygen ≥ 2 L\/min to emulate a target trial aimed at assessing the effectiveness of HCQ at 600 mg\/day... This study included 181 patients with SARS-CoV-2 pneumonia; 84 received HCQ within 48 hours of admission (HCQ group) and 97 did not (no-HCQ group). The median age of patients was 60 years ...\" \"...[Patients were from] four French tertiary care centres providing care to patients with COVID-19 pneumonia. Adult patients were eligible in this study if they were aged between 18 years and 80 years, had PCR-confirmed SARS-CoV-2 infection, and required oxygen by mask or nasal prongs (corresponding to a WHO progression score of 5).\" \"Among the 181 patients eligible for analysis, 84 received HCQ within 48 hours of admission and 97 did not (although 8 of them did receive HCQ later on).\" So, first of all, these patients were infected with Covid-19 _days_ prior and now had progressed to pneumonia. The up to two-day delay in the administration of HCQ after admittance to the study is disheartening. I am surprised that, despite the experimentors selecting an elderly, pneumonic, oxygen-dependent cohort in advanced stages of the disease, these patients did as well as they did. Its a credit to the human body. But timing is everything... Once a Covid-19 patient has developed pneumonia, it is too late for hydroxychloroquine to affect the Covid-19 virus' replication process significantly. The patient's body is saturated with the virus. In a patient who has developed pneumonia the disease has progressed to a  second phase wherein the virus and other opportunistic pathogens (e.g., bacteria) attack the lungs and other tissue. Antibiotics may help at this point. But it is quite clear that the patients in this study arrived too late to gain any benefit from hydroxychloroquine  which, when coupled with zinc sulfate, slows or halts viral replication _early_ in the disease, delays or halts the virus' progress and allows the body time to develop an immunological response to the virus. The study's conclusion states explicitly that \" These results ... do not support the use of HCQ in patients hospitalised for a documented SARS-CoV-2 pneumonia.\" So, the trick is to treat _early_ with HCQ+zinc sulfate+azithromycin.","salty_score":0.4656824665},{"rank":90,"user_name":"skavi","text":"Each A13 Lightning core has around 2.5x the transistors of a Skylake core. The Skylake design is also 5 years old and on a node at least a generation out of date. Geekbench is also a short enough test that thermals aren’t a huge concern.","salty_score":0.4657190319},{"rank":91,"user_name":"diebeforei485","text":"And you installed no internal apps at all? How did you get on the corporate Wi-Fi? How do you send print jobs to the office printer? It's quite rare for company-owned macs to be completely unmanaged. Usually the installation method for common corporate utilities is an MDM solution like Jamf (Self Service), which also transmits logs - for example how long each app was in the foreground[1] and what times you're using your computer[2]. 1. http:\/\/archive.today\/tfYtO 2. http:\/\/archive.today\/MkBKE","salty_score":0.4659821527},{"rank":92,"user_name":"triceratops","text":"Oats, frozen vegetables, frozen rye bread (tastes awesome toasted and buttered), whole wheat, brown rice, beans and legumes.","salty_score":0.4660374122},{"rank":93,"user_name":"majormajor","text":"Restaurant bookings and travel were falling sharply in CA even before the official stay-at-home policies[0], so your alternative is a world where huge chunks of the economy are still fucked. Unless you want to force people to eat at restaurants, travel to conferences, host events, etc... [0] there's this from March 13, for instance https:\/\/blog.opentable.com\/2020\/covid-19-coronavirus-restaur... , googling conference cancellations and such is left as an exercise for the reader...","salty_score":0.4661964001},{"rank":94,"user_name":"Hypx","text":"That’s really the only reason to favor BEVs over hydrogen. Everything else, from weight, cost (eventually), range, raw material requirements, are better with fuel cells.","salty_score":0.4663389776},{"rank":95,"user_name":"baybal2","text":"Yes, Intel's \"marketing TDP\" is a complete sham. You get completely different digits once you get full engineering datasheets under NDAs. Intel's 5W \"ultraportable\" CPUs for examples go to 17W. 15W ones can boost well above 40W.","salty_score":0.4666378103},{"rank":96,"user_name":"rckoepke","text":"# of job postings mentioning each brand on Indeed.com: Justinmind - 6\nBalsamiq - 327\nAxure - 602\nFigma - 635\nXD - 686\nInvision - 1717","salty_score":0.4666861956},{"rank":97,"user_name":"duskwuff","text":"All commercial radio and television stations in the US have call signs starting with K or W. The division is geographic -- west coast stations use K; east coast stations use W. (The dividing line is, roughly speaking, drawn at the Mississippi River.)","salty_score":0.466947351},{"rank":98,"user_name":"elcritch","text":"Hmmm, you might look up how dendrites form. They’re roughly analogous in how the thermodynamics are favorable to forming more complex structures, IIRC. But it’s easier\/more intuit to see how dendrites form. Dendrite formation is also a huge problem in many fields, like electronics manufacturing (eg tin whiskers).","salty_score":0.4674080284},{"rank":99,"user_name":"SpicyLemonZest","text":"The county health officials would presumably coordinate with each other, as San Francisco and San Mateo are already doing.","salty_score":0.4674343122},{"rank":100,"user_name":"madaxe_again","text":"Hah, that mirrors my wife’s experience in Riga - she came second and first in national physics competitions for two years, and was twice invited to enroll in a different school - but she stayed put, because she didn’t want to have to change trams twice, rather than a direct trolley bus. She’s happy with her choice.","salty_score":0.4675791738}]